# DWGImportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWGImportOptions Constructor
DWGImportOptions Class See Also
---
Constructs a new instance of DWGImportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public DWGImportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DWGImportOptions()
```

# See Also
DWGImportOptions Class
DWGImportOptions Overload
Autodesk.Revit.DB Namespace